list_of_cities = [
    {
        'Барнаул': 5,
        'Краснодар': 9,
        'Красноярск': 9,
        'Махачкала': 5,
        'Новосибирск': 7,
        'Пермь': 3,
        'Ростов-на-Дону': 5,
        'Самара': 2,
        'Санкт-Петербург': 6,
        'Хабаровск': 7
    },
    {
        'Липецк': 1,
        'Пермь': 9,
        'Ростов-на-Дону': 6,
        'Тула': 3,
        'Ульяновск': 7,
        'Ярославль': 9
    },
    {
        'Краснодар': 4,
        'Красноярск': 1,
        'Москва': 1,
        'Санкт-Петербург': 4,
        'Тольятти': 9,
        'Тула': 2,
        'Тюмень': 5,
        'Ульяновск': 4
    },
]

list_concatenation = {}

for dicts in list_of_cities:
    for k, v in dicts.items():
        if k in list_concatenation:
            list_concatenation[k] |= {v}
        else:
            list_concatenation[k] = {v}

print(*{f'{k!r}: {v}' for k, v in list_concatenation.items()}, sep=',\n')

# 'Самара': {2},
# 'Барнаул': {5},
# 'Махачкала': {5},
# 'Хабаровск': {7},
# 'Москва': {1},
# 'Липецк': {1},
# 'Тольятти': {9},
# 'Ростов-на-Дону': {5, 6},
# 'Красноярск': {9, 1},
# 'Ярославль': {9},
# 'Пермь': {9, 3},
# 'Тюмень': {5},
# 'Тула': {2, 3},
# 'Краснодар': {9, 4},
# 'Ульяновск': {4, 7},
# 'Новосибирск': {7},
# 'Санкт-Петербург': {4, 6}